In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, np.nan, 35, 40],
    'City': ['Tashkent', 'Samarkand', np.nan, 'Bukhara']
}

In [3]:
df = pd.DataFrame(data)

In [4]:
# Check missing values
print(df.isnull())

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [5]:
# Drop rows with missing values
df_drop = df.dropna()

In [6]:
df_drop

    Name   Age      City
0  Alice  25.0  Tashkent
3  David  40.0   Bukhara

In [9]:
# Fill missing values
df_fill = df.fillna({
    'Age': df['Age'].mean(),
    'City': 'Unknown'
})
print(df_fill)

      Name        Age       City
0    Alice  25.000000   Tashkent
1      Bob  33.333333  Samarkand
2  Charlie  35.000000    Unknown
3    David  40.000000    Bukhara

In [17]:
#To rename Column's name 
df1 = df.rename(columns={'City':'Location'})
print(df1)

      Name   Age   Location
0    Alice  25.0   Tashkent
1      Bob   NaN  Samarkand
2  Charlie  35.0        NaN
3    David  40.0    Bukhara

In [20]:
# To change same words
df1['Location'] = df1['Location'].replace('Unknown', 'Nan')
print(df1)

      Name   Age   Location
0    Alice  25.0   Tashkent
1      Bob   NaN  Samarkand
2  Charlie  35.0        NaN
3    David  40.0    Bukhara

In [22]:
# To drop a column 
df1 = df1.drop(columns = ['Name'])
print(df1)

    Age   Location
0  25.0   Tashkent
1   NaN  Samarkand
2  35.0        NaN
3  40.0    Bukhara

In [24]:
#Convert Data Types
df['Age'] = df['Age'].astype(int)
print(df.dtypes)

In [25]:
# Example: Add a new column "IsAdult"
df1['IsAdult'] = df1['Age'] >= 26
print(df1)

    Age   Location  IsAdult
0  25.0   Tashkent    False
1   NaN  Samarkand    False
2  35.0        NaN     True
3  40.0    Bukhara     True

In [27]:

# Example: Create a full name
df1['FullInfo'] = df1['Location'] + " - " + df1['IsAdult'].astype(str)
print(df1)

    Age   Location  IsAdult           FullInfo
0  25.0   Tashkent    False   Tashkent - False
1   NaN  Samarkand    False  Samarkand - False
2  35.0        NaN     True                NaN
3  40.0    Bukhara     True     Bukhara - True

In [44]:
#  Mini Exercise
# Create a DataFrame with ['Name', 'Score', 'Country']
# Introduce one NaN manually
# Replace NaN with a value
# Add a new column: Passed = Score >= 60

data1 = {
            'Name':['John', 'Mate', 'Lisa'],
            'Score':[70, 95, 85],
            'Country':['USA', np.nan,'China']
        }


data1 = pd.DataFrame(data1)
print(data1)

print('---------------------------\n---------------------------')

data1['Country'] = data1['Country'].replace(np.nan, 'USA')
print(data1)

print('---------------------------\n---------------------------')

data1['passed'] = data1['Score'] >= 71
print(data1)

   Name  Score Country
0  John     70     USA
1  Mate     95     NaN
2  Lisa     85   China
---------------------------
---------------------------
   Name  Score Country
0  John     70     USA
1  Mate     95     USA
2  Lisa     85   China
---------------------------
---------------------------
   Name  Score Country  passed
0  John     70     USA   False
1  Mate     95     USA    True
2  Lisa     85   China    True